In [ ]:
https://www.w3resource.com/python-exercises/pandas/index-dataframe.php

In [ ]:
# 1. Write a Pandas program to get the powers of an array values element-wise.

In [47]:
import pandas as pd
import numpy as np

In [4]:
sample_data = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]})
sample_data

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [ ]:
# 2. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index 
#labels.

In [107]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
                         
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [108]:
exam_status = pd.DataFrame(exam_data, labels)
exam_status

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [ ]:
#3. Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data

In [12]:
exam_status.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
name        10 non-null object
score       10 non-null object
attempts    10 non-null int64
qualify     10 non-null object
dtypes: int64(1), object(3)
memory usage: 400.0+ bytes

In [13]:
exam_status.describe()

        attempts
count  10.000000
mean    1.900000
std     0.875595
min     1.000000
25%     1.000000
50%     2.000000
75%     2.750000
max     3.000000

In [ ]:
#4. Write a Pandas program to get the first 3 rows of a given DataFrame

In [15]:
exam_status.head(4)

        name   score  attempts qualify
a  Anastasia    12.5         1     yes
b       Dima       9         3      no
c  Katherine    16.5         2     yes
d      James  np.nan         3      no

In [ ]:
#5. Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame

In [18]:
exam_status.iloc[:,0:2]

        name   score
a  Anastasia    12.5
b       Dima       9
c  Katherine    16.5
d      James  np.nan
e      Emily       9
f    Michael      20
g    Matthew    14.5
h      Laura  np.nan
i      Kevin       8
j      Jonas      19

In [ ]:
#6.Write a Pandas program to select the specified columns and rows from a given data frame.

In [20]:
exam_status.iloc[1:9:2, 0:2]

      name   score
b     Dima       9
d    James  np.nan
f  Michael      20
h    Laura  np.nan

In [ ]:
#7. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2

In [26]:
exam_status.loc[exam_status['attempts'] > 2].iloc[:,0:2]

      name   score
b     Dima       9
d    James  np.nan
f  Michael      20

In [ ]:
#8. Write a Pandas program to count the number of rows and columns of a DataFrame.

In [29]:
len(exam_status.count(axis = 'rows'))

4

In [30]:
len(exam_status.count(axis = 'columns'))

10

In [ ]:
#9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN

In [33]:
exam_status.loc[exam_status['score'] == 'np.nan'].iloc[:,0:2]

    name   score
d  James  np.nan
h  Laura  np.nan

In [ ]:
#10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).

In [109]:
exam_status.dtypes

name         object
score       float64
attempts      int64
qualify      object
dtype: object

In [110]:
exam_status[(exam_status['score'] >= 15) & (exam_status['score'] <= 20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [ ]:
exam_status.loc[exam_status["score"] >=]

In [ ]:
# 11. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 
# and score greater than 15

In [113]:
exam_status[(exam_status['attempts'] < 2) & (exam_status['score'] > 15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [ ]:
#12. Write a Pandas program to change the score in row 'd' to 11.5.

In [ ]:
https://stackoverflow.com/questions/13842088/set-value-for-particular-cell-in-pandas-dataframe-using-index

In [49]:
exam_status.loc['d','score'] = 11.5

In [50]:
exam_status

        name   score  attempts qualify
a  Anastasia    12.5         1     yes
b       Dima       9         3      no
c  Katherine    16.5         2     yes
d      James    11.5         3      no
e      Emily       9         2      no
f    Michael      20         3     yes
g    Matthew    14.5         1     yes
h      Laura  np.nan         1      no
i      Kevin       8         2      no
j      Jonas      19         1     yes

In [ ]:
#13. Write a Pandas program to calculate the sum of the examination attempts by the students

In [82]:
exam_status['attempts'].sum(axis = 0, skipna = True)

20

In [ ]:
#13a. Write a Pandas program to calculate the sum of the examination scores by the students

In [114]:
exam_status['score'].sum()

108.5

In [ ]:
#14. Write a Pandas program to calculate the mean score for the students in DataFrame

In [ ]:
https://www.geeksforgeeks.org/python-pandas-dataframe-mean/

In [115]:
exam_status['score'].mean()

13.5625

In [ ]:
# 15. Write a Pandas program to append a new row 'k' to data frame with given values for each column

In [79]:
exam_status.loc['k'] = ['Suresh', 15.5, 1, 'yes']

In [80]:
exam_status

        name   score  attempts qualify
a  Anastasia    12.5         1     yes
b       Dima       9         3      no
c  Katherine    16.5         2     yes
d      James    11.5         3      no
e      Emily       9         2      no
f    Michael      20         3     yes
g    Matthew    14.5         1     yes
h      Laura  np.nan         1      no
i      Kevin       8         2      no
j      Jonas      19         1     yes
k     Suresh    15.5         1     yes

In [ ]:
# 16. Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in 
#ascending order.

In [ ]:
https://stackoverflow.com/questions/17141558/how-to-sort-a-dataframe-in-python-pandas-by-two-or-more-columns

In [84]:
exam_status.sort_values(['name', 'score'], ascending = [False, True])

        name   score  attempts qualify
k     Suresh    15.5         1     yes
f    Michael      20         3     yes
g    Matthew    14.5         1     yes
h      Laura  np.nan         1      no
i      Kevin       8         2      no
c  Katherine    16.5         2     yes
j      Jonas      19         1     yes
d      James    11.5         3      no
e      Emily       9         2      no
b       Dima       9         3      no
a  Anastasia    12.5         1     yes

In [ ]:
# 17. Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False.

In [ ]:
https://www.geeksforgeeks.org/python-pandas-dataframe-replace/

In [87]:
exam_status_replace = exam_status.replace(to_replace = ['yes', 'no'], value = [True, False])
exam_status_replace

        name   score  attempts  qualify
a  Anastasia    12.5         1     True
b       Dima       9         3    False
c  Katherine    16.5         2     True
d      James    11.5         3    False
e      Emily       9         2    False
f    Michael      20         3     True
g    Matthew    14.5         1     True
h      Laura  np.nan         1    False
i      Kevin       8         2    False
j      Jonas      19         1     True
k     Suresh    15.5         1     True

In [ ]:
# 18. Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame

In [88]:
exam_status_replace2 = exam_status.replace(to_replace = 'Suresh', value = 'James')
exam_status_replace2

        name   score  attempts qualify
a  Anastasia    12.5         1     yes
b       Dima       9         3      no
c  Katherine    16.5         2     yes
d      James    11.5         3      no
e      Emily       9         2      no
f    Michael      20         3     yes
g    Matthew    14.5         1     yes
h      Laura  np.nan         1      no
i      Kevin       8         2      no
j      Jonas      19         1     yes
k      James    15.5         1     yes

In [ ]:
# 19. Write a Pandas program to delete the 'attempts' column from the DataFrame

In [89]:
drop_attempts = exam_status.drop(['attempts'], axis = 1)
drop_attempts

        name   score qualify
a  Anastasia    12.5     yes
b       Dima       9      no
c  Katherine    16.5     yes
d      James    11.5      no
e      Emily       9      no
f    Michael      20     yes
g    Matthew    14.5     yes
h      Laura  np.nan      no
i      Kevin       8      no
j      Jonas      19     yes
k     Suresh    15.5     yes

In [ ]:
# 20 Write a Pandas program to insert a new column in existing DataFrame

In [126]:
colors = ['red', 'fuscia', 'green', 'blue', 'orange', 'cyan', 'teal', 'hot pink', 'gray', 'maroon']

In [127]:
exam_status['color'] = colors
exam_status

        name  score  attempts qualify     color
a  Anastasia   12.5         1     yes       red
b       Dima    9.0         3      no    fuscia
c  Katherine   16.5         2     yes     green
d      James    NaN         3      no      blue
e      Emily    9.0         2      no    orange
f    Michael   20.0         3     yes      cyan
g    Matthew   14.5         1     yes      teal
h      Laura    NaN         1      no  hot pink
i      Kevin    8.0         2      no      gray
j      Jonas   19.0         1     yes    maroon